{
  "backend/main.mo": "Primary Motoko canister defining core application state, types, and logic for user profiles, internships, company submissions (with blob storage), contact forms, and admin authorization, including migration support and access control.",
  "backend/migration.mo": "Defines a data migration that upgrades stored CompanySubmission records by adding an empty legalDocuments field when moving from the old schema to the new one.",
  "feature_evidence.json": "Structured report documenting implemented features, affected frontend files, dependencies, test requirements, and confidence levels for recent authentication, contact form, and company submission enhancements.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files, pages, hooks, components, and utilities used in the application.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, color palettes, and base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application configuring routing, layout, authentication-aware profile setup, admin and company route guards, theming, and global UI providers.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information, branding, and an external link with an icon.",
  "frontend/src/components/Header.tsx": "Renders the main application header with navigation buttons and login/logout handling using Internet Identity. It conditionally routes users based on authentication and admin status and highlights the active route.",
  "frontend/src/components/InternshipFormDialog.tsx": "Provides a modal dialog for creating or editing internship listings with controlled form state and validation. It integrates with add/update internship mutation hooks and calls a success callback on completion.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a mandatory profile setup dialog for new users to enter name, email, and account type. It validates inputs (including school email rules) and returns a UserProfile via an onSave callback.",
  "frontend/src/components/RouteGuard.tsx": "Guards routes by checking authentication, admin privileges, or company account type before rendering children. It shows loading states or access-denied messages and redirects unauthenticated users to home.",
  "frontend/src/data/seedPartnerInternships.ts": "Defines a static list of partner internship seed data as InternshipInput objects. The data includes titles, companies, locations, categories, descriptions, and application links.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using React Query based on the current Internet Identity. It initializes access control, supports anonymous actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for Internet Identity authentication, handling AuthClient creation, login/logout, persisted identity loading, and exposing login status helpers via a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data (user profiles, internships, categories, admin actions), integrating actor access, Internet Identity auth checks, cache invalidation, and toast notifications.",
  "frontend/src/index.css": "Configures Tailwind CSS base, components, and utilities with extensive CSS variables for theming, including light and dark color palettes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React application, rendering App inside QueryClientProvider and InternetIdentityProvider, and imports global styles.",
  "frontend/src/pages/AboutPage.tsx": "Implements a static About page describing the Bridge Project’s mission, features, and supported technical programs using card-based UI components and icons.",
  "frontend/src/pages/AdminCompanySubmissionsPage.tsx": "Admin page that fetches and displays company survey submissions, handling loading and error states and rendering detailed submission cards with partnership status and contact info.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard for managing internships and admin tools, including listing, adding, editing, deleting internships, seeding data, promoting admins, and enforcing admin-only access.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders an admin login and access-check flow using Internet Identity, showing login prompts, loading states, and admin/denied status UI with navigation.",
  "frontend/src/pages/CompanyPortalPage.tsx": "Implements a multi-field company survey form with validation, file uploads converted to ExternalBlobs, and submission via a mutation hook with progress and success handling.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact page with direct email info and a contact form that submits messages via a mutation hook and shows a temporary success state.",
  "frontend/src/pages/HomePage.tsx": "Displays the public homepage with categorized internship fields, icons, and expandable descriptions, and navigation to other parts of the app.",
  "frontend/src/pages/PublicPage.tsx": "Shows a public or authenticated internship listing page with category tabs, login gating, data fetching, filtering, and loading states based on authentication.",
  "frontend/src/utils/fileToExternalBlob.ts": "Utility to convert browser File objects into ExternalBlob instances with optional upload progress tracking, plus a helper to format file sizes.",
  "frontend/src/utils/safeExternalLink.ts": "Utility that normalizes and validates external URLs, ensuring a safe default and adding https:// when appropriate.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query strings or hash-based routing and persist them in sessionStorage. Includes helpers to retrieve, store, clear, and persist parameters across navigation, primarily for sensitive tokens like admin secrets.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with class-based dark mode, custom container settings, extended color system using CSS variables (OKLCH), animations, and design tokens. Enables typography, container queries, and animation plugins.",
  "project_state.json": "Defines the high-level project description and structured state for a full-stack ICP web app, including schema versioning and a catalog of implemented features. Documents authentication, RBAC, user onboarding, internship browsing, and admin functionality with IDs and descriptions."
}